In [1]:
import pandas as pd
import numpy as np

import matplotlib.pylab as plt
import seaborn as sns

In [2]:
att = pd.read_csv('https://gist.githubusercontent.com/o0amandagomez0o/20c8edc2cb83d33da03c8fd2f9db4c4c/raw/attendance.csv')

In [5]:
att.head()

,name,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [4]:
#fix the ugly column name
att.rename(columns={'Unnamed: 0': 'name'}, inplace=True)

### pd.metl arguments
* id_vars = columns you want to keep (not melt)
* var_name = name of new column you created by melting columns
* value_name = column name for values

In [6]:
#make a wide table long
att = att.melt(id_vars='name', #keep this column fixed
                  var_name='date', #name of the new column
                  value_name='attend') #name of the new column based on the values of the "date" column

In [7]:
att.head()

    name        date attend
0  Sally  2018-01-01      P
1   Jane  2018-01-01      A
2  Billy  2018-01-01      A
3   John  2018-01-01      P
4  Sally  2018-01-02      T

In [8]:
#convert objects to values
att.attend = att.attend.map({'P':1, 'A':0, 'H':.5, 'T':.9})

In [10]:
att.head()

    name        date  attend
0  Sally  2018-01-01     1.0
1   Jane  2018-01-01     0.0
2  Billy  2018-01-01     0.0
3   John  2018-01-01     1.0
4  Sally  2018-01-02     0.9

In [11]:
cl = pd.read_csv('https://gist.githubusercontent.com/o0amandagomez0o/f6ea956fedae90420fd2ce4bd382ea8a/raw/coffee_levels.csv')
cl.head()

   hour coffee_carafe  coffee_amount
0     8             x       0.816164
1     9             x       0.451018
2    10             x       0.843279
3    11             x       0.335533
4    12             x       0.898291

In [13]:
#pivot the table 
clp=cl.pivot_table(index='hour', columns='coffee_carafe', values='coffee_amount')

In [14]:
clp.head()

coffee_carafe         x         y         z
hour
8              0.816164  0.189297  0.999264
9              0.451018  0.521502  0.915990
10             0.843279  0.023163  0.144928
11             0.335533  0.235529  0.311495
12             0.898291  0.017009  0.771947

In [ ]:
#this is good for plotting and for seeing the pefromance of each carafe per hour